<?php
/**
 * +----------------------------------------------------------------------
 * | Created by 诚挚先生.
 * +----------------------------------------------------------------------
 * | Author: 诚挚先生 <3289614616@qq.com>
 * +----------------------------------------------------------------------
 * | Date: 2019/3/17
 * +----------------------------------------------------------------------
 * | Time: 20:17
 * +----------------------------------------------------------------------
 */

namespace Framework\zCore;
use Framework\zCore\UserStrategy;

class FemaleStrategy implements UserStrategy
{
    public function showAd() {
       echo "AD:\n";
       echo "2019年新款香水！";
    }
    public function showCategory() {
      echo "化妆品！";
    }
}